# Removed headers from dataset and end rows containing text not relevant for coding

In [1]:
# Dependencies
import pandas as pd

In [2]:
# Read Excel and specific tab
age_df = pd.read_excel("Resources/commonwealth electorate data.xls", sheet_name = "Table 2")

In [3]:
# Show first 5 rows
age_df.head()

,electoral_division,0 to 17 years old,18 to 34 years old,35 to 49 years old,50 to 64 years old,65 to 79 years old,80 years old and over
0,Adelaide,0.179,0.313,0.195,0.166,0.102,0.045
1,Aston,0.215,0.234,0.205,0.193,0.115,0.038
2,Ballarat,0.231,0.220,0.189,0.188,0.130,0.042
3,Banks,0.210,0.253,0.197,0.182,0.108,0.049
4,Barker,0.221,0.187,0.183,0.210,0.150,0.049

In [5]:
# Show all columns
age_df.columns

Index(['electoral_division', '0 to 17 years old', '18 to 34 years old',
       '35 to 49 years old', '50 to 64 years old', '65 to 79 years old',
       '80 years old and over'],
      dtype='object')

In [6]:
# Show all datatypes
age_df.dtypes

electoral_division        object
0 to 17 years old        float64
18 to 34 years old       float64
35 to 49 years old       float64
50 to 64 years old       float64
65 to 79 years old       float64
80 years old and over    float64
dtype: object

The datatypes are as expected (object for division name and float for the remaining as these represent percentages.

In [7]:
# Count rows
len(age_df)

151

In [8]:
# Drop missing values values
age_df = age_df.dropna(how="any")
age_df.head()

,electoral_division,0 to 17 years old,18 to 34 years old,35 to 49 years old,50 to 64 years old,65 to 79 years old,80 years old and over
0,Adelaide,0.179,0.313,0.195,0.166,0.102,0.045
1,Aston,0.215,0.234,0.205,0.193,0.115,0.038
2,Ballarat,0.231,0.220,0.189,0.188,0.130,0.042
3,Banks,0.210,0.253,0.197,0.182,0.108,0.049
4,Barker,0.221,0.187,0.183,0.210,0.150,0.049

In [9]:
# Count rows age demo
len(age_df)

151

In [10]:
# Read in electorate division info csv
div_df = pd.read_csv("01-output_electorate_division_information/electoral_division.csv")
div_df.head()

   division_id electoral_division state
0          179           Adelaide    SA
1          197              Aston   VIC
2          198           Ballarat   VIC
3          103              Banks   NSW
4          180             Barker    SA

In [11]:
# Drop state column
div_df.drop(["state"], axis=1, inplace=True)
div_df.head()

   division_id electoral_division
0          179           Adelaide
1          197              Aston
2          198           Ballarat
3          103              Banks
4          180             Barker

In [13]:
# Add in division_id column to cultural_diversity df through left join
merged = pd.merge(age_df, div_df, how="outer", on="electoral_division")
merged.head()

,electoral_division,0 to 17 years old,18 to 34 years old,35 to 49 years old,50 to 64 years old,65 to 79 years old,80 years old and over,division_id
0,Adelaide,0.179,0.313,0.195,0.166,0.102,0.045,179.0
1,Aston,0.215,0.234,0.205,0.193,0.115,0.038,197.0
2,Ballarat,0.231,0.220,0.189,0.188,0.130,0.042,198.0
3,Banks,0.210,0.253,0.197,0.182,0.108,0.049,103.0
4,Barker,0.221,0.187,0.183,0.210,0.150,0.049,180.0

In [14]:
# Count rows merged df
len(merged)

158

In [18]:
merged.head()

,electoral_division,0 to 17 years old,18 to 34 years old,35 to 49 years old,50 to 64 years old,65 to 79 years old,80 years old and over,division_id
0,Adelaide,0.179,0.313,0.195,0.166,0.102,0.045,179.0
1,Aston,0.215,0.234,0.205,0.193,0.115,0.038,197.0
2,Ballarat,0.231,0.220,0.189,0.188,0.130,0.042,198.0
3,Banks,0.210,0.253,0.197,0.182,0.108,0.049,103.0
4,Barker,0.221,0.187,0.183,0.210,0.150,0.049,180.0

In [19]:
# Round division_id

In [21]:
# Read in Excel and specific tab population count
pop_df = pd.read_excel("Resources/commonwealth electorate data.xls", sheet_name = "Table 1")

In [22]:
# Count rows pop count
len(pop_df)

151

In [24]:
# Merge dataframes to add in pop count
merged2 = pd.merge(merged, pop_df,  
                     on ='electoral_division',  
                     how ='outer') 

merged2

,electoral_division,0 to 17 years old,18 to 34 years old,35 to 49 years old,50 to 64 years old,65 to 79 years old,80 years old and over,division_id,2017 Estimated Resident Population counts
0,Adelaide,0.179,0.313,0.195,0.166,0.102,0.045,179.0,188410.0
1,Aston,0.215,0.234,0.205,0.193,0.115,0.038,197.0,161813.0
2,Ballarat,0.231,0.220,0.189,0.188,0.130,0.042,198.0,154461.0
3,Banks,0.210,0.253,0.197,0.182,0.108,0.049,103.0,164403.0
4,Barker,0.221,0.187,0.183,0.210,0.150,0.049,180.0,171058.0
...,...,...,...,...,...,...,...,...,...
153,McMillan,NaN,NaN,NaN,NaN,NaN,NaN,227.0,NaN
154,Melbourne Ports,NaN,NaN,NaN,NaN,NaN,NaN,230.0,NaN
155,Murray,NaN,NaN,NaN,NaN,NaN,NaN,231.0,NaN
156,Port Adelaide,NaN,NaN,NaN,NaN,NaN,NaN,189.0,NaN
157,Wakefield,NaN,NaN,NaN,NaN,NaN,NaN,191.0,NaN

In [25]:
# Rename columns
merged2.rename(columns={"0 to 17 years old": "0-17", "18 to 34 years old": "18-34", "35 to 49 years old":"35-49", "50 to 64 years old":"50-64", "65 to 79 years old":"65-79", "80 years old and over":"80+", "2017 Estimated Resident Population counts":"pop_count_est"}, inplace=True)
merged2.head()

,electoral_division,0-17,18-34,35-49,50-64,65-79,80+,division_id,pop_count_est
0,Adelaide,0.179,0.313,0.195,0.166,0.102,0.045,179.0,188410.0
1,Aston,0.215,0.234,0.205,0.193,0.115,0.038,197.0,161813.0
2,Ballarat,0.231,0.220,0.189,0.188,0.130,0.042,198.0,154461.0
3,Banks,0.210,0.253,0.197,0.182,0.108,0.049,103.0,164403.0
4,Barker,0.221,0.187,0.183,0.210,0.150,0.049,180.0,171058.0

In [26]:
# Count rows merged2 df
len(merged2)

158

In [34]:
# Group by electoral_division and division_id, TBC whether we include state
df_age_div_pop  = merged2.groupby(["electoral_division", "division_id"]).sum()
df_age_div_pop

,,0-17,18-34,35-49,50-64,65-79,80+,pop_count_est
electoral_division,division_id,,,,,,,
Adelaide,179.0,0.179,0.313,0.195,0.166,0.102,0.045,188410.0
Aston,197.0,0.215,0.234,0.205,0.193,0.115,0.038,161813.0
Ballarat,198.0,0.231,0.220,0.189,0.188,0.130,0.042,154461.0
Banks,103.0,0.210,0.253,0.197,0.182,0.108,0.049,164403.0
Barker,180.0,0.221,0.187,0.183,0.210,0.150,0.049,171058.0
...,...,...,...,...,...,...,...,...
Werriwa,153.0,0.273,0.249,0.208,0.169,0.079,0.022,181173.0
Whitlam,150.0,0.234,0.200,0.184,0.188,0.144,0.049,158340.0
Wide Bay,178.0,0.213,0.151,0.176,0.227,0.183,0.049,147406.0
Wills,234.0,0.183,0.329,0.218,0.138,0.083,0.048,168833.0
Wright,316.0,0.256,0.202,0.206,0.192,0.117,0.027,165418.0

In [35]:
# Count rows df_final
len(df_age_div_pop)

150

# rows have disappeared above (from 151 to 143)!?

In [36]:
# Check columns before grouping by bins
df_age_div_pop.columns

Index(['0-17', '18-34', '35-49', '50-64', '65-79', '80+', 'pop_count_est'], dtype='object')

In [37]:
# export df to csv
df_age_div_pop.to_csv("08-output_2016_commonwealth_electoral_population_age/08-extracting_transforming_commonwealth_electoral_population_age.csv")